In [30]:
# DoL
topnames = {'year':[2018,2018,2017,2017,2016,2016],
           'sex':['Male','Female','Male','Female','Male','Female'],
           'name':['Liam','Emma','Liam','Emma','Noah','Emma'],
           'count':[19837,18688,18798,19800,19117,1996]}

In [31]:
topnames

{'year': [2018, 2018, 2017, 2017, 2016, 2016],
 'sex': ['Male', 'Female', 'Male', 'Female', 'Male', 'Female'],
 'name': ['Liam', 'Emma', 'Liam', 'Emma', 'Noah', 'Emma'],
 'count': [19837, 18688, 18798, 19800, 19117, 1996]}

In [33]:
topnames['year']

[2018, 2018, 2017, 2017, 2016, 2016]

In [9]:
[topnames['year'][3],topnames['sex'][3],topnames['name'][3],topnames['count'][3]]

[2017, 'Female', 'Emma', 19800]

In [40]:
# LoL
topnames = [[2018,'Male','Liam',19837],
           [2018,'Female','Emma',18688],
           [2017,'Male','Liam',18798],
           [2017,'Female','Emma',19800],
           [2016,'Male','Noah',19117],
           [2016,'Female','Emma',19496]]

In [35]:
topnames[3]

[2017, 'Female', 'Emma', 19800]

In [42]:
my_row = []
# return the year col
for i in range(len(topnames)):
    my_row.append(topnames[i][0])
my_row

[2018, 2018, 2017, 2017, 2016, 2016]

In [47]:
# work with pandas instead
import pandas as pd
# Pandas dataframe
df = pd.DataFrame(topnames,columns=['year','sex','name','count'])
df

   year     sex  name  count
0  2018    Male  Liam  19837
1  2018  Female  Emma  18688
2  2017    Male  Liam  18798
3  2017  Female  Emma  19800
4  2016    Male  Noah  19117
5  2016  Female  Emma  19496

In [49]:
# very easy to access cols
print(df.iloc[:,0]) # returns the year col using index location
print(df['year']) # likewise, but using col name

0    2018
1    2018
2    2017
3    2017
4    2016
5    2016
Name: year, dtype: int64
0    2018
1    2018
2    2017
3    2017
4    2016
5    2016
Name: year, dtype: int64

In [51]:
# very easy to access rows too!
df.iloc[3,:]

year       2017
sex      Female
name       Emma
count     19800
Name: 3, dtype: object

In [53]:
print(df.iloc[3,:][0]) # data in row 3 col 1
print(df['year'][3]) # same info

2017
2017

In [54]:
type(df) # df is a DataFrame object

pandas.core.frame.DataFrame

In [56]:
type(df['year']) # Pandas Series are arrays like in numpy

pandas.core.series.Series

In [58]:
df['year']*2 # broadcasting here works because pandas is built on numpy

0    4036
1    4036
2    4034
3    4034
4    4032
5    4032
Name: year, dtype: int64